Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 20, 70)            20720     
_________________________________________________________________
lstm_1 (LSTM)                (None, 20, 40)            17760     
_________________________________________________________________
lstm_2 (LSTM)                (None, 20, 25)            6600      
_________________________________________________________________
lstm_3 (LSTM)                (None, 15)                2460      
_________________________________________________________________
dense (Dense)                (None, 3)                 48        
=================================================================
Total params: 47,588
Trainable params: 47,588
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 15
Epochs: 228
Execution time: 818.62
