Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_4 (LSTM)                (None, 20, 70)            20440     
_________________________________________________________________
lstm_5 (LSTM)                (None, 20, 40)            17760     
_________________________________________________________________
lstm_6 (LSTM)                (None, 20, 25)            6600      
_________________________________________________________________
lstm_7 (LSTM)                (None, 15)                2460      
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 32        
=================================================================
Total params: 47,292
Trainable params: 47,292
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 10
Epochs: 69
Execution time: 1255.13
