Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed (TimeDistri (None, 20, 78, 118, 32)   320       
_________________________________________________________________
time_distributed_1 (TimeDist (None, 20, 76, 116, 32)   9248      
_________________________________________________________________
time_distributed_2 (TimeDist (None, 20, 38, 58, 32)    0         
_________________________________________________________________
conv_lst_m2d (ConvLSTM2D)    (None, 38, 58, 5)         6680      
_________________________________________________________________
flatten (Flatten)            (None, 11020)             0         
_________________________________________________________________
dense (Dense)                (None, 9600)              105801600 
=================================================================
Total params: 105,817,848
Trainable params: 105,817,848
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 10
Epochs: 12
Execution time: 12305.99
